OFtutorialTest04_MRF/rhoPimpleFoam/debug_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    HUB
    {
        type            noSlip;
    }
    SHROUD
    {
        type            noSlip;
    }
    INFLOW
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    OUTFLOW
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    BLADE
    {
        type            noSlip;
    }
    PER1
    {
        type            empty;
    }
    PER2
    {
        type            empty;
    }
}


// ************************************************************************* //
