OFtutorialTest04_MRF/rhoPimpleFoam/debug_case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INFLOW
    {
        type            calculated;
        value           uniform 0;
    }
    OUTFLOW
    {
        type            calculated;
        value           uniform 0;
    }
    
    BLADE
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    HUB
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    SHROUD
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    PER1
    {
        type            empty;
    }
    
    PER2
    {
        type            empty;
    }
}


// ************************************************************************* //
